In [37]:
import pandas as pd

In [38]:
data = [
    {"id": 1, "val": 0.001, "alias": "A"},
    {"id": 1, "val": 0.001, "alias": "A"},
    {"id": 1, "val": 0.001, "alias": "B"},
    {"id": 1, "val": 0.001, "alias": "B"},
    {"id": 1, "val": 0.001, "alias": "B"},
    {"id": 1, "val": 0.001, "alias": "C"},
    {"id": 2, "val": 0.001, "alias": "A"},
    {"id": 2, "val": 0.001, "alias": "B"},
    {"id": 2, "val": 0.001, "alias": "A"},
    {"id": 3, "val": 0.001, "alias": "D"},
]
df = pd.DataFrame(data)

In [39]:
df

  alias  id    val
0     A   1  0.001
1     A   1  0.001
2     B   1  0.001
3     B   1  0.001
4     B   1  0.001
5     C   1  0.001
6     A   2  0.001
7     B   2  0.001
8     A   2  0.001
9     D   3  0.001

In [40]:
summed = df.groupby(['id', 'alias']).sum()

In [41]:
summed

            val
id alias
1  A      0.002
   B      0.003
   C      0.001
2  A      0.002
   B      0.001
3  D      0.001

In [42]:
summed.unstack()

         val
alias      A      B      C      D
id
1      0.002  0.003  0.001    NaN
2      0.002  0.001    NaN    NaN
3        NaN    NaN    NaN  0.001

In [44]:
## OR
summed.reset_index(inplace=True)
summed

   index  id alias    val
0      0   1     A  0.002
1      1   1     B  0.003
2      2   1     C  0.001
3      3   2     A  0.002
4      4   2     B  0.001
5      5   3     D  0.001

In [45]:
summed.pivot(index='id', columns='alias', values='val')

alias      A      B      C      D
id
1      0.002  0.003  0.001    NaN
2      0.002  0.001    NaN    NaN
3        NaN    NaN    NaN  0.001